#+BEGIN: kanban :mirrored nil :match "active"
| TODO                                          | WIP | STALLED | DONE                                                                         | DEPRECATED                                                    | CANCELLED |
|-----------------------------------------------+-----+---------+------------------------------------------------------------------------------+---------------------------------------------------------------+-----------|
|                                               |     |         | [[Update x64nNN systems to latest installed versions, and get docker installed][Update x64nNN systems to latest installed versions, and get docker installed]] |                                                               |           |
|                                               |     |         | [[Get docker prod swarm in place][Get docker prod swarm in place]]                                               |                                                               |           |
| [[Get salt-master dockerized and in prod swarm][Get salt-master dockerized and in prod swarm]]  |     |         |                                                                              |                                                               |           |
|                                               |     |         | [[Get GoGS dockerized, and setup in HA fashion on prod swarm][Get GoGS dockerized, and setup in HA fashion on prod swarm]]                   |                                                               |           |
|                                               |     |         | [[Get Drone server and at least 2 agents setup in the dev swarm][Get Drone server and at least 2 agents setup in the dev swarm]]                |                                                               |           |
|                                               |     |         |                                                                              | [[Get collectd-docker instances running and get instrumentation][Get collectd-docker instances running and get instrumentation]] |           |
|                                               |     |         | [[get docker registry (unauthenticated) setup in prod][get docker registry (unauthenticated) setup in prod]]                          |                                                               |           |
|                                               |     |         | [[deploy traefik to production swarm][deploy traefik to production swarm]]                                           |                                                               |           |
|                                               |     |         | [[get nfs mount on /srv to all the prod docker machines][get nfs mount on /srv to all the prod docker machines]]                        |                                                               |           |
|                                               |     |         | [[Get metrics docker images up to date][Get metrics docker images up to date]]                                         |                                                               |           |
| [[Get collectd installed on all the swarm nodes][Get collectd installed on all the swarm nodes]] |     |         |                                                                              |                                                               |           |
#+END:

* TODO [#P] [9/13] Get devel/infra pipeline in place                  :infra:
** DONE [#A] Update x64nNN systems to latest installed versions, and get docker installed :active:
  - Note taken on [2018-08-22 Wed 10:08] \\
    all 3 boxen are updated to 4.14.65, have applied all system updates, and are running docker
  - Note taken on [2018-08-22 Wed 09:47] \\
    taking a small unscheduled smoke break while last kernel builds
  - Note taken on [2018-08-22 Wed 09:39] \\
    have updated system packages and kernels on x64n01 and n02, n03 is building it's new kernel now
  - Note taken on [2018-08-22 Wed 08:24] \\
    building kernels with all the proper NAT options for iptables use by docker currently on x64n02 and 03, 01 is done.
  - Note taken on [2018-08-21 Tue 23:11] \\
    have @world @system run going on x64n01, installing docker on x64n02
  :LOGBOOK:
  CLOCK: [2018-08-22 Wed 09:38]--[2018-08-22 Wed 10:03] =>  0:25
  CLOCK: [2018-08-22 Wed 08:35]--[2018-08-22 Wed 09:00] =>  0:25
  CLOCK: [2018-08-22 Wed 08:15]--[2018-08-22 Wed 08:35] =>  0:20
  CLOCK: [2018-08-21 Tue 23:12]--[2018-08-21 Tue 23:37] =>  0:25
  CLOCK: [2018-08-21 Tue 17:51]--[2018-08-21 Tue 18:16] =>  0:25
  :END:
** DONE [#A] Get docker prod swarm in place :active:
   CLOSED: [2018-08-23 Thu 14:08]
   - CLOSING NOTE [2018-08-22 Wed 11:07] \\
     prod swarm is up and running
   :LOGBOOK:
   CLOCK: [2018-08-22 Wed 10:11]--[2018-08-22 Wed 10:36] =>  0:25
   :END:
   - Note taken on [2018-08-21 Tue 17:26] \\
     x64n01 is a bit out of date, updating portage and starting @system and @world builds
** TODO [#A] Get docker dev swarm in place :backlog:
** TODO [#B] Get docker swarms documented :backlog:
** TODO [#A] Get salt-master dockerized and in prod swarm :active:
   SCHEDULED: <2018-08-23 Thu>
** DONE [#B] Get GoGS dockerized, and setup in HA fashion on prod swarm :active:
   CLOSED: [2018-08-23 Thu 16:50]
   - CLOSING NOTE [2018-08-23 Thu 16:50] \\
     verified working
   - CLOSING NOTE [2018-08-22 Wed 12:45] \\
     gogs is accessible at http://x64n01/
   :LOGBOOK:
   CLOCK: [2018-08-22 Wed 12:06]--[2018-08-22 Wed 12:31] =>  0:25
   :END:
** DONE [#B] Get Drone server and at least 2 agents setup in the dev swarm :active:
   CLOSED: [2018-08-23 Thu 16:50]
   - CLOSING NOTE [2018-08-23 Thu 16:50] \\
     verified working
   - CLOSING NOTE [2018-08-22 Wed 22:42] \\
     have 4 agents running
   - Note taken on [2018-08-22 Wed 22:30] \\
     gogs/drone-server are up and running, validation is still to come. working on agents now
   - Note taken on [2018-08-22 Wed 14:36] \\
     having issues with docker dns drone server can't resolve name of gogs server (same swarm)
   :LOGBOOK:
   CLOCK: [2018-08-22 Wed 22:16]--[2018-08-22 Wed 22:41] =>  0:25
   CLOCK: [2018-08-22 Wed 12:48]--[2018-08-22 Wed 13:13] =>  0:25
   :END:
** TODO [#C] Re-visit all services and dockerize urrything :backlog:
** DEPRECATED [#A] Get collectd-docker instances running and get instrumentation :active:
   CLOSED: [2018-08-24 Fri 20:26]
   - CLOSING NOTE [2018-08-24 Fri 20:26] \\
     deprecated this
** DONE [#A] get docker registry (unauthenticated) setup in prod :active:
  CLOSED: [2018-08-22 Wed 12:02]
  - CLOSING NOTE [2018-08-22 Wed 12:02] \\
    registry is deployed on local prod
** DONE [#A] deploy traefik to production swarm :active:
   CLOSED: [2018-08-23 Thu 18:56]
   - CLOSING NOTE [2018-08-23 Thu 18:56] \\
     up and running as expected
  - CLOSING NOTE [2018-08-22 Wed 11:56] \\
    traefik is deployed on the prod cluster
  :LOGBOOK:
  CLOCK: [2018-08-22 Wed 11:52]--[2018-08-22 Wed 11:56] =>  0:04
  :END:
** DONE [#A] get nfs mount on /srv to all the prod docker machines :active:
  CLOSED: [2018-08-22 Wed 11:51]
  - CLOSING NOTE [2018-08-22 Wed 11:51] \\
    nas01:/srv/docker is mounted on /srv and persistent in /etc/fstab
  ASSIGNEE: fuzzy
  PROJECT: infra

** DONE [#A] Get metrics docker images up to date                    :active:
   CLOSED: [2018-08-24 Fri 20:26]
   - CLOSING NOTE [2018-08-24 Fri 20:26] \\
     got prometheus up and collecting metrics, will add collectors later for other stuff
   ASSIGNEE: fuzzy
   PROJECT: infra
** TODO [#B] Get collectd installed on all the swarm nodes :active:
   SCHEDULED:
   ASSIGNEE: fuzzy
   PROJECT: infra

